app/controllers/places_controller.rb

INSERT INTO "places" ("name", "number", "street", "suburb", "state", "zip", "user_id", "created_at", "updated_at", "latitude", "longitude") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @place = Place.new(place_params)
    @place.user = current_user
    if @place.save(place_params)

SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "places" SET "name" = $1, "zip" = $2, "updated_at" = $3 WHERE "places"."id" = $4  [["name", "Lydia's House"], ["zip", "4226"], ["updated_at", "2019-10-22 02:41:15.743857"], ["id", 10]]
---
  def update
    @place = Place.find(params[:id])
    if @place.update(place_params)